MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MCXC242VFM/mcu.h
#define ADC0_SC1A                     (*((volatile uint32_t *)0x4003B000))      // ADC Status and Control Registers 1 (ADC0_SC1A)
#define ADC0_SC1B                     (*((volatile uint32_t *)0x4003B004))      // ADC Status and Control Registers 1 (ADC0_SC1B)
#define ADC0_CFG1                     (*((volatile uint32_t *)0x4003B008))      // ADC Configuration Register 1 (ADC0_CFG1)
#define ADC0_CFG2                     (*((volatile uint32_t *)0x4003B00C))      // ADC Configuration Register 2 (ADC0_CFG2)
#define ADC0_RA                       (*((volatile uint32_t *)0x4003B010))      // ADC Data Result Register (ADC0_RA)
#define ADC0_RB                       (*((volatile uint32_t *)0x4003B014))      // ADC Data Result Register (ADC0_RB)
#define ADC0_CV1                      (*((volatile uint32_t *)0x4003B018))      // Compare Value Registers (ADC0_CV1)
#define ADC0_CV2                      (*((volatile uint32_t *)0x4003B01C))      // Compare Value Registers (ADC0_CV2)
#define ADC0_SC2                      (*((volatile uint32_t *)0x4003B020))      // Status and Control Register 2 (ADC0_SC2)
#define ADC0_SC3                      (*((volatile uint32_t *)0x4003B024))      // Status and Control Register 3 (ADC0_SC3)
#define ADC0_OFS                      (*((volatile uint32_t *)0x4003B028))      // ADC Offset Correction Register (ADC0_OFS)
#define ADC0_PG                       (*((volatile uint32_t *)0x4003B02C))      // ADC Plus-Side Gain Register (ADC0_PG)
#define ADC0_MG                       (*((volatile uint32_t *)0x4003B030))      // ADC Minus-Side Gain Register (ADC0_MG)
#define ADC0_CLPD                     (*((volatile uint32_t *)0x4003B034))      // ADC Plus-Side General Calibration Value Register (ADC0_CLPD)
#define ADC0_CLPS                     (*((volatile uint32_t *)0x4003B038))      // ADC Plus-Side General Calibration Value Register (ADC0_CLPS)
#define ADC0_CLP4                     (*((volatile uint32_t *)0x4003B03C))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP4)
#define ADC0_CLP3                     (*((volatile uint32_t *)0x4003B040))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP3)
#define ADC0_CLP2                     (*((volatile uint32_t *)0x4003B044))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP2)
#define ADC0_CLP1                     (*((volatile uint32_t *)0x4003B048))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP1)
#define ADC0_CLP0                     (*((volatile uint32_t *)0x4003B04C))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP0)
#define ADC0_CLMD                     (*((volatile uint32_t *)0x4003B054))      // ADC Minus-Side General Calibration Value Register (ADC0_CLMD)
#define ADC0_CLMS                     (*((volatile uint32_t *)0x4003B058))      // ADC Minus-Side General Calibration Value Register (ADC0_CLMS)
#define ADC0_CLM4                     (*((volatile uint32_t *)0x4003B05C))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM4)
#define ADC0_CLM3                     (*((volatile uint32_t *)0x4003B060))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM3)
#define ADC0_CLM2                     (*((volatile uint32_t *)0x4003B064))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM2)
#define ADC0_CLM1                     (*((volatile uint32_t *)0x4003B068))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM1)
#define ADC0_CLM0                     (*((volatile uint32_t *)0x4003B06C))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM0)


//*****************************************************************************
//
// Comparator (CMP) registers
//
//*****************************************************************************

#define CMP0_CR0                      (*((volatile uint32_t *)0x40073000))      // CMP Control Register 0 (CMP0_CR0)
#define CMP0_CR1                      (*((volatile uint32_t *)0x40073001))      // CMP Control Register 1 (CMP0_CR1)
#define CMP0_FPR                      (*((volatile uint32_t *)0x40073002))      // CMP Filter Period Register (CMP0_FPR)
#define CMP0_SCR                      (*((volatile uint32_t *)0x40073003))      // CMP Status and Control Register (CMP0_SCR)
#define CMP0_DACCR                    (*((volatile uint32_t *)0x40073004))      // DAC Control Register (CMP0_DACCR)
#define CMP0_MUXCR                    (*((volatile uint32_t *)0x40073005))      // MUX Control Register (CMP0_MUXCR)


//*****************************************************************************
//
// Voltage Reference (VREFV1) registers
//
//*****************************************************************************

#define VREF_TRM                      (*((volatile uint32_t *)0x40074000))      // VREF Trim Register (VREF_TRM)
#define VREF_SC                       (*((volatile uint32_t *)0x40074001))      // VREF Status and Control Register (VREF_SC)


//*****************************************************************************
//
// Multipurpose Clock Generator Lite (MCG_Lite) registers
//
//*****************************************************************************

#define MCG_C1                        (*((volatile uint32_t *)0x40064000))      // MCG Control Register 1
#define MCG_C2                        (*((volatile uint32_t *)0x40064001))      // MCG Control Register 2
#define MCG_S                         (*((volatile uint32_t *)0x40064006))      // MCG Status Register
#define MCG_SC                        (*((volatile uint32_t *)0x40064008))      // MCG Status and Control Register
#define MCG_MC                        (*((volatile uint32_t *)0x40064018))      // MCG Miscellaneous Control Register


//*****************************************************************************
//
// Oscillator (OSC) registers
//
//*****************************************************************************

#define OSC0_CR                       (*((volatile uint32_t *)0x40065000))      // OSC Control Register (OSC0_CR)


//*****************************************************************************
//
// Real Time Clock (RTC) registers
//
//*****************************************************************************

#define RTC_TSR                       (*((volatile uint32_t *)0x4003D000))      // RTC Time Seconds Register
#define RTC_TPR                       (*((volatile uint32_t *)0x4003D004))      // RTC Time Prescaler Register
#define RTC_TAR                       (*((volatile uint32_t *)0x4003D008))      // RTC Time Alarm Register
#define RTC_TCR                       (*((volatile uint32_t *)0x4003D00C))      // RTC Time Compensation Register
#define RTC_CR                        (*((volatile uint32_t *)0x4003D010))      // RTC Control Register
#define RTC_SR                        (*((volatile uint32_t *)0x4003D014))      // RTC Status Register
#define RTC_LR                        (*((volatile uint32_t *)0x4003D018))      // RTC Lock Register
#define RTC_IER                       (*((volatile uint32_t *)0x4003D01C))      // RTC Interrupt Enable Register


//*****************************************************************************
//
// Periodic Interrupt Timer (PIT) registers
//
//*****************************************************************************

#define PIT_MCR                       (*((volatile uint32_t *)0x40037000))      // PIT Module Control Register (PIT_MCR)
#define PIT_LTMR64H                   (*((volatile uint32_t *)0x400370E0))      // PIT Upper Lifetime Timer Register (PIT_LTMR64H)
#define PIT_LTMR64L                   (*((volatile uint32_t *)0x400370E4))      // PIT Lower Lifetime Timer Register (PIT_LTMR64L)
#define PIT_LDVAL0                    (*((volatile uint32_t *)0x40037100))      // Timer Load Value Register (PIT_LDVAL0)
#define PIT_CVAL0                     (*((volatile uint32_t *)0x40037104))      // Current Timer Value Register (PIT_CVAL0)
#define PIT_TCTRL0                    (*((volatile uint32_t *)0x40037108))      // Timer Control Register (PIT_TCTRL0)
#define PIT_TFLG0                     (*((volatile uint32_t *)0x4003710C))      // Timer Flag Register (PIT_TFLG0)
#define PIT_LDVAL1                    (*((volatile uint32_t *)0x40037110))      // Timer Load Value Register (PIT_LDVAL1)
#define PIT_CVAL1                     (*((volatile uint32_t *)0x40037114))      // Current Timer Value Register (PIT_CVAL1)
#define PIT_TCTRL1                    (*((volatile uint32_t *)0x40037118))      // Timer Control Register (PIT_TCTRL1)
#define PIT_TFLG1                     (*((volatile uint32_t *)0x4003711C))      // Timer Flag Register (PIT_TFLG1)


//*****************************************************************************
//
// Low-Power Timer (LPTMR) registers
//
//*****************************************************************************

#define LPTMR0_CSR                    (*((volatile uint32_t *)0x40040000))      // Low Power Timer Control Status Register (LPTMR0_CSR)
#define LPTMR0_PSR                    (*((volatile uint32_t *)0x40040004))      // Low Power Timer Prescale Register (LPTMR0_PSR)
#define LPTMR0_CMR                    (*((volatile uint32_t *)0x40040008))      // Low Power Timer Compare Register (LPTMR0_CMR)
#define LPTMR0_CNR                    (*((volatile uint32_t *)0x4004000C))      // Low Power Timer Counter Register (LPTMR0_CNR)


//*****************************************************************************
//
// Cyclic Redundancy Check (CRC) registers
//
//*****************************************************************************

#define CRC_DATA                      (*((volatile uint32_t *)0x40032000))      // CRC Data register
#define CRC_GPOLY                     (*((volatile uint32_t *)0x40032004))      // CRC Polynomial register
#define CRC_CTRL                      (*((volatile uint32_t *)0x40032008))      // CRC Control register


//*****************************************************************************
//
// Universal Asynchronous Receiver/Transmitter(UART) registers
//
//*****************************************************************************

#define UART2_BDH                     (*((volatile uint32_t *)0x4006C000))      // UART Baud Rate Registers: High
#define UART2_BDL                     (*((volatile uint32_t *)0x4006C001))      // UART Baud Rate Registers: Low
#define UART2_C1                      (*((volatile uint32_t *)0x4006C002))      // UART Control Register 1
#define UART2_C2                      (*((volatile uint32_t *)0x4006C003))      // UART Control Register 2
#define UART2_S1                      (*((volatile uint32_t *)0x4006C004))      // UART Status Register 1
#define UART2_S2                      (*((volatile uint32_t *)0x4006C005))      // UART Status Register 2
#define UART2_C3                      (*((volatile uint32_t *)0x4006C006))      // UART Control Register 3
#define UART2_D                       (*((volatile uint32_t *)0x4006C007))      // UART Data Register
#define UART2_MA1                     (*((volatile uint32_t *)0x4006C008))      // UART Match Address Registers 1
#define UART2_MA2                     (*((volatile uint32_t *)0x4006C009))      // UART Match Address Registers 2
#define UART2_C4                      (*((volatile uint32_t *)0x4006C00A))      // UART Control Register 4
#define UART2_C5                      (*((volatile uint32_t *)0x4006C00B))      // UART Control Register 5
#define UART2_C7816                   (*((volatile uint32_t *)0x4006C018))      // UART 7816 Control Register
#define UART2_IE7816                  (*((volatile uint32_t *)0x4006C019))      // UART 7816 Interrupt Enable Register
#define UART2_IS7816                  (*((volatile uint32_t *)0x4006C01A))      // UART 7816 Interrupt Status Register
#define UART2_WP7816                  (*((volatile uint32_t *)0x4006C01B))      // UART 7816 Wait Parameter Register
#define UART2_WN7816                  (*((volatile uint32_t *)0x4006C01C))      // UART 7816 Wait N Register
#define UART2_WF7816                  (*((volatile uint32_t *)0x4006C01D))      // UART 7816 Wait FD Register
#define UART2_ET7816                  (*((volatile uint32_t *)0x4006C01E))      // UART 7816 Error Threshold Register
#define UART2_TL7816                  (*((volatile uint32_t *)0x4006C01F))      // UART 7816 Transmit Length Register
#define UART2_AP7816A_T0              (*((volatile uint32_t *)0x4006C03A))      // UART 7816 ATR Duration Timer Register A
#define UART2_AP7816B_T0              (*((volatile uint32_t *)0x4006C03B))      // UART 7816 ATR Duration Timer Register B
#define UART2_WP7816A_T0              (*((volatile uint32_t *)0x4006C03C))      // UART 7816 Wait Parameter Register A
#define UART2_WP7816A_T1              (*((volatile uint32_t *)0x4006C03C))      // UART 7816 Wait Parameter Register A
#define UART2_WP7816B_T0              (*((volatile uint32_t *)0x4006C03D))      // UART 7816 Wait Parameter Register B
#define UART2_WP7816B_T1              (*((volatile uint32_t *)0x4006C03D))      // UART 7816 Wait Parameter Register B
#define UART2_WGP7816_T1              (*((volatile uint32_t *)0x4006C03E))      // UART 7816 Wait and Guard Parameter Register
#define UART2_WP7816C_T1              (*((volatile uint32_t *)0x4006C03F))      // UART 7816 Wait Parameter Register C


//*****************************************************************************
//
// Low Power Universal asynchronous receiver/transmitter (LPUART) registers
//
//*****************************************************************************

#define LPUART0_BAUD                  (*((volatile uint32_t *)0x40054000))      // LPUART Baud Rate Register (LPUART0_BAUD)
#define LPUART0_STAT                  (*((volatile uint32_t *)0x40054004))      // LPUART Status Register (LPUART0_STAT)
#define LPUART0_CTRL                  (*((volatile uint32_t *)0x40054008))      // LPUART Control Register (LPUART0_CTRL)
#define LPUART0_DATA                  (*((volatile uint32_t *)0x4005400C))      // LPUART Data Register (LPUART0_DATA)
#define LPUART0_MATCH                 (*((volatile uint32_t *)0x40054010))      // LPUART Match Address Register (LPUART0_MATCH)
#define LPUART1_BAUD                  (*((volatile uint32_t *)0x40055000))      // LPUART Baud Rate Register (LPUART1_BAUD)
#define LPUART1_STAT                  (*((volatile uint32_t *)0x40055004))      // LPUART Status Register (LPUART1_STAT)
#define LPUART1_CTRL                  (*((volatile uint32_t *)0x40055008))      // LPUART Control Register (LPUART1_CTRL)
#define LPUART1_DATA                  (*((volatile uint32_t *)0x4005500C))      // LPUART Data Register (LPUART1_DATA)
#define LPUART1_MATCH                 (*((volatile uint32_t *)0x40055010))      // LPUART Match Address Register (LPUART1_MATCH)


//*****************************************************************************
//
// Serial Peripheral Interface (SPI) registers
//
//*****************************************************************************

#define SPI0_S                        (*((volatile uint32_t *)0x40076000))      // SPI Status Register (SPI0_S)
#define SPI0_BR                       (*((volatile uint32_t *)0x40076001))      // SPI Baud Rate Register (SPI0_BR)
#define SPI0_C2                       (*((volatile uint32_t *)0x40076002))      // SPI Control Register 2 (SPI0_C2)
#define SPI0_C1                       (*((volatile uint32_t *)0x40076003))      // SPI Control Register 1 (SPI0_C1)
#define SPI0_ML                       (*((volatile uint32_t *)0x40076004))      // SPI Match Register low (SPI0_ML)
#define SPI0_MH                       (*((volatile uint32_t *)0x40076005))      // SPI match register high (SPI0_MH)
#define SPI0_DL                       (*((volatile uint32_t *)0x40076006))      // SPI Data Register low (SPI0_DL)
#define SPI0_DH                       (*((volatile uint32_t *)0x40076007))      // SPI data register high (SPI0_DH)
#define SPI0_CI                       (*((volatile uint32_t *)0x4007600A))      // SPI clear interrupt register (SPI0_CI)
#define SPI0_C3                       (*((volatile uint32_t *)0x4007600B))      // SPI control register 3 (SPI0_C3)
#define SPI1_S                        (*((volatile uint32_t *)0x40077000))      // SPI Status Register (SPI1_S)
#define SPI1_BR                       (*((volatile uint32_t *)0x40077001))      // SPI Baud Rate Register (SPI1_BR)
#define SPI1_C2                       (*((volatile uint32_t *)0x40077002))      // SPI Control Register 2 (SPI1_C2)
#define SPI1_C1                       (*((volatile uint32_t *)0x40077003))      // SPI Control Register 1 (SPI1_C1)
#define SPI1_ML                       (*((volatile uint32_t *)0x40077004))      // SPI Match Register low (SPI1_ML)
#define SPI1_MH                       (*((volatile uint32_t *)0x40077005))      // SPI match register high (SPI1_MH)
#define SPI1_DL                       (*((volatile uint32_t *)0x40077006))      // SPI Data Register low (SPI1_DL)
#define SPI1_DH                       (*((volatile uint32_t *)0x40077007))      // SPI data register high (SPI1_DH)
#define SPI1_CI                       (*((volatile uint32_t *)0x4007700A))      // SPI clear interrupt register (SPI1_CI)
#define SPI1_C3                       (*((volatile uint32_t *)0x4007700B))      // SPI control register 3 (SPI1_C3)


//*****************************************************************************
//
// Inter-Integrated Circuit (I2C) registers
//
//*****************************************************************************

#define I2C0_A1                       (*((volatile uint32_t *)0x40066000))      // I2C Address Register 1
#define I2C0_F                        (*((volatile uint32_t *)0x40066001))      // I2C Frequency Divider register
#define I2C0_C1                       (*((volatile uint32_t *)0x40066002))      // I2C Control Register 1
#define I2C0_S                        (*((volatile uint32_t *)0x40066003))      // I2C Status register
#define I2C0_D                        (*((volatile uint32_t *)0x40066004))      // I2C Data I/O register
#define I2C0_C2                       (*((volatile uint32_t *)0x40066005))      // I2C Control Register 2
#define I2C0_FLT                      (*((volatile uint32_t *)0x40066006))      // I2C Programmable Input Glitch Filter Register
#define I2C0_RA                       (*((volatile uint32_t *)0x40066007))      // I2C Range Address register
#define I2C0_SMB                      (*((volatile uint32_t *)0x40066008))      // I2C SMBus Control and Status register
#define I2C0_A2                       (*((volatile uint32_t *)0x40066009))      // I2C Address Register 2
#define I2C0_SLTH                     (*((volatile uint32_t *)0x4006600A))      // I2C SCL Low Timeout Register High
#define I2C0_SLTL                     (*((volatile uint32_t *)0x4006600B))      // I2C SCL Low Timeout Register Low
#define I2C0_S2                       (*((volatile uint32_t *)0x4006600C))      // I2C Status register 2
#define I2C1_A1                       (*((volatile uint32_t *)0x40067000))      // I2C Address Register 1
#define I2C1_F                        (*((volatile uint32_t *)0x40067001))      // I2C Frequency Divider register
#define I2C1_C1                       (*((volatile uint32_t *)0x40067002))      // I2C Control Register 1
#define I2C1_S                        (*((volatile uint32_t *)0x40067003))      // I2C Status register
#define I2C1_D                        (*((volatile uint32_t *)0x40067004))      // I2C Data I/O register
#define I2C1_C2                       (*((volatile uint32_t *)0x40067005))      // I2C Control Register 2
#define I2C1_FLT                      (*((volatile uint32_t *)0x40067006))      // I2C Programmable Input Glitch Filter Register
#define I2C1_RA                       (*((volatile uint32_t *)0x40067007))      // I2C Range Address register
#define I2C1_SMB                      (*((volatile uint32_t *)0x40067008))      // I2C SMBus Control and Status register
#define I2C1_A2                       (*((volatile uint32_t *)0x40067009))      // I2C Address Register 2
#define I2C1_SLTH                     (*((volatile uint32_t *)0x4006700A))      // I2C SCL Low Timeout Register High
#define I2C1_SLTL                     (*((volatile uint32_t *)0x4006700B))      // I2C SCL Low Timeout Register Low
#define I2C1_S2                       (*((volatile uint32_t *)0x4006700C))      // I2C Status register 2


//*****************************************************************************
//
// Universal Serial Bus (USB) FS Subsystem registers
//
//*****************************************************************************

