MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MCXC242VFM/mcu.h
#define OSC32KSEL                     0x00180000      // 32K Oscillator Clock Select
#define OSC32KOUT                     0x00060000      // 32K oscillator clock output


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT2 register.
//
//*****************************************************************************

#define LPUART1SRC                    0x60000000      // LPUART1 Clock Source Select
#define LPUART0SRC                    0x18000000      // LPUART0 Clock Source Select
#define TPMSRC                        0x06000000      // TPM Clock Source Select
#define FLEXIOSRC                     0x01800000      // FlexIO Module Clock Source Select
#define USBSRC                        0x00040000      // USB clock source select
#define CLKOUTSEL                     0x00000380      // CLKOUT select
#define RTCCLKOUTSEL                  0x00000010      // RTC  Clock Out Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT4 register.
//
//*****************************************************************************

#define TPM2CLKSEL                    0x04000000      // TPM2 External Clock Pin Select
#define TPM1CLKSEL                    0x02000000      // TPM1 External Clock Pin Select
#define TPM0CLKSEL                    0x01000000      // TPM0 External Clock Pin Select
#define TPM2CH0SRC                    0x00100000      // TPM2 Channel 0 Input Capture Source Select
#define TPM1CH0SRC                    0x00180000      // TPM1 channel 0 input capture source select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT5 register.
//
//*****************************************************************************

#define UART2ODE                      0x00040000      // UART2 Open Drain Enable
#define LPUART1ODE                    0x00020000      // LPUART1 Open Drain Enable
#define LPUART0ODE                    0x00010000      // LPUART0 Open Drain Enable
#define LPUART1RXSRC                  0x00000040      // LPUART1 Receive Data Source Select
#define LPUART1TXSRC                  0x00000060      // LPUART1 Transmit Data Source Select
#define LPUART0RXSRC                  0x00000004      // LPUART0 Receive Data Source Select
#define LPUART0TXSRC                  0x00000006      // LPUART0 Transmit Data Source Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT7 register.
//
//*****************************************************************************

#define ADC0ALTTRGEN                  0x00000080      // ADC0 Alternate Trigger Enable
#define ADC0PRETRGSEL                 0x00000010      // ADC0 Pretrigger Select
#define ADC0TRGSEL                    0x00000078      // ADC0 Trigger Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SDID register.
//
//*****************************************************************************

#define FAMID                         0x780000000      // MCX C family ID
#define SUBFAMID                      0x78000000      // Sub-Family ID
#define SERIESID                      0x07800000      // Series ID
#define SRAMSIZE                      0x00780000      // SRAM Size
#define REVID                         0x00078000      // Device Revision Number
#define DIEID                         0x0000F800      // Device Die Number
#define PINID                         0x000001C0      // Pincount Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC4 register.
//
//*****************************************************************************

#define SPI1                          0x00800000      // SPI1 Clock Gate Control
#define SPI0                          0x00400000      // SPI0 Clock Gate Control
#define VREF                          0x00100000      // VREF Clock Gate Control
#define CMP0                          0x00080000      // Comparator Clock Gate Control
#define USBFS                         0x00040000      // USB Clock Gate Control
#define UART2                         0x00001000      // UART2 Clock Gate Control
#define I2C1                          0x00000080      // I2C1 Clock Gate Control
#define I2C0                          0x00000040      // I2C0 Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC5 register.
//
//*****************************************************************************

#define LPUART1                       0x00200000      // LPUART1 Clock Gate Control
#define LPUART0                       0x00100000      // LPUART0 Clock Gate Control
#define PORTE                         0x00002000      // Port E Clock Gate Control
#define PORTD                         0x00001000      // Port D Clock Gate Control
#define PORTC                         0x00000800      // Port C Clock Gate Control
#define PORTB                         0x00000400      // Port B Clock Gate Control
#define PORTA                         0x00000200      // Port A Clock Gate Control
#define LPTMR                         0x00000001      // Low Power Timer Access Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC6 register.
//
//*****************************************************************************

#define RTC                           0x20000000      // RTC Access Control
#define ADC0                          0x08000000      // ADC0 Clock Gate Control
#define TPM2                          0x04000000      // TPM2 Clock Gate Control
#define TPM1                          0x02000000      // TPM1 Clock Gate Control
#define TPM0                          0x01000000      // TPM0 Clock Gate Control
#define PIT                           0x00800000      // PIT Clock Gate Control
#define CRC                           0x00040000      // CRC Clock Gate Control
#define DMAMUX                        0x00000002      // DMA Mux Clock Gate Control
#define FTF                           0x00000001      // Flash Memory Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC7 register.
//
//*****************************************************************************

